In [1]:
import pandas as pd
import statistics as sts
import seaborn as sbr

In [2]:
# importando dados
dataset = pd.read_csv('funcionarios.csv')

# vendo tabela
dataset.head()

    Nome  Idade   Salário      Setor Ativo
0   João     25    3000.0         TI   sim
1  Maria    -20    4000.0         RH   não
2  Pedro     45       NaN  Comercial   sim
3    Ana     30  999999.0      menos   NaN

In [3]:
dataset.shape

(4, 5)

In [4]:
dataset.isnull().sum()

Nome       0
Idade      0
Salário    1
Setor      0
Ativo      1
dtype: int64

IDADE

In [5]:
# Verificando idade
dataset.loc[(dataset["Idade"] < 0) | (dataset["Idade"] > 120)]

    Nome  Idade  Salário Setor Ativo
1  Maria    -20   4000.0    RH   não

In [6]:
# Média das idades
media = sts.mean(dataset["Idade"])
media

20

In [7]:
# Trocando pela média
dataset.loc[(dataset["Idade"] < 0)|(dataset["Idade"] > 120), "Idade"] = media

In [8]:
# Verificando
dataset.loc[(dataset["Idade"] < 0) | (dataset["Idade"] > 120)]

Empty DataFrame
Columns: [Nome, Idade, Salário, Setor, Ativo]
Index: []

SALARIO

In [9]:
# Pegando a moda
moda = sts.mode(dataset["Salário"])
moda

3000.0

In [12]:
# Substituindo valores NA pela moda
dataset.fillna({"Salário":moda}, inplace=True)

In [13]:
dataset.loc[(dataset["Salário"]) > 10000, "Salário"] = moda

In [14]:
dataset.head()

    Nome  Idade  Salário      Setor Ativo
0   João     25   3000.0         TI   sim
1  Maria     20   4000.0         RH   não
2  Pedro     45   3000.0  Comercial   sim
3    Ana     30   3000.0      menos   NaN

SETOR

In [17]:
agrupado = dataset.groupby(["Setor"]).size()
agrupado

Setor
Comercial    1
RH           1
TI           1
menos        1
dtype: int64

In [20]:
# Trocando o menos por TI
dataset.loc[(dataset["Setor"] == "menos" ), "Setor"] = "TI"

In [21]:
#Verificando
agrupado = dataset.groupby(["Setor"]).size()
agrupado

Setor
Comercial    1
RH           1
TI           2
dtype: int64

ATIVO

In [22]:
moda = sts.mode(dataset["Ativo"])
moda

'sim'

In [25]:
dataset.fillna({"Ativo": moda}, inplace=True)

VERIFICANDO

In [27]:
dataset.head()

    Nome  Idade  Salário      Setor Ativo
0   João     25   3000.0         TI   sim
1  Maria     20   4000.0         RH   não
2  Pedro     45   3000.0  Comercial   sim
3    Ana     30   3000.0         TI   sim